IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l11xx_l13xx/DMA_1.0.xml
    </group>
    <register id="DMA_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to interrupt event INT_EVENT[0]" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to generic event  INT_EVENT[1]" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="DMA_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the DMA: number of DMA channel minus one  (e.g. 0-&gt;1ch, 2-&gt;3ch, 15-&gt;16ch)." begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value (1 channel)"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest value (16 channel)"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="DMA_DMAPRIO" width="32" offset="0x1100" description="DMA Channel Priority Control">
        <bitfield id="ROUNDROBIN" description="Round robin. This bit enables the round-robin DMA channel priorities." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Roundrobin priority disabled, DMA channel priority is fixed: DMA0-DMA1-DMA2-...-DMA16"/>
            <bitenum id="ENABLE" value="0x1" description="Roundrobin priority enabled, DMA channel priority changes with each transfer"/>
        </bitfield>
        <bitfield id="BURSTSZ" description="Define the burst size of a block transfer, before the priority is re-evaluated" begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="INFINITI" value="0x0" description="There is no burst size, the whole block transfer is completed on one transfer without interruption"/>
            <bitenum id="BURST_8" value="0x1" description="The burst size is 8, after 8 transfers the block transfer is interrupted and the priority is reevaluated"/>
            <bitenum id="BUSRT_16" value="0x2" description="The burst size is 16, after 16 transfers the block transfer is interrupted and the priority is reevaluated"/>
            <bitenum id="BURST_32" value="0x3" description="The burst size is 32, after 32 transfers the block transfer is interrupted and the priority is reevaluated"/>
        </bitfield>
    </register>
    <group id="DMA_DMATRIG" name="DMA_DMATRIG" instances="3" offset="0x1110" instaddr="0x4" description="">
        <register id="DMA_DMATCTL" width="32" offset="0x0" description="DMA Trigger Select">
            <bitfield id="DMATSEL" description="DMA Trigger Select 

Note: Reference the datasheet of the device to see the specific trigger mapping." begin="5" end="0" width="6" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="DMAREQ" value="0x0" description="Software trigger request"/>
                <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
            </bitfield>
            <bitfield id="DMATINT" description="DMA Trigger by Internal Channel" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="EXTERNAL" value="0x0" description="DMATSEL will define external trigger select as transfer trigger."/>
                <bitenum id="INTERNAL" value="0x1" description="DMATSEL will define internal channel as transfer trigger select. 0-&gt; Channel0-done, 1-&gt; Channel1-done, ..."/>
            </bitfield>
        </register>
    </group>
    <group id="DMA_DMACHAN" name="DMA_DMACHAN" instances="3" offset="0x1200" instaddr="0x10" description="">
        <register id="DMA_DMACTL" width="32" offset="0x0" description="DMA Channel Control">
            <bitfield id="DMAREQ" description="DMA request. Software-controlled DMA start. DMAREQ is reset automatically." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="IDLE" value="0x0" description="Default read value"/>
                <bitenum id="REQUEST" value="0x1" description="DMA transfer request (start DMA)"/>
            </bitfield>
            <bitfield id="DMAEN" description="DMA enable" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="DMA channel disabled"/>
                <bitenum id="ENABLE" value="0x1" description="DMA channel enabled"/>
            </bitfield>
            <bitfield id="DMASRCWDTH" description="DMA source width. This bit selects the source data width as a byte, half word, word or long word." begin="9" end="8" width="2" rwaccess="R/W">
                <bitenum id="BYTE" value="0x0" description="Source data width is BYTE (8-bit)"/>
                <bitenum id="HALF" value="0x1" description="Source data width is HALF-WORD (16-bit)"/>
                <bitenum id="WORD" value="0x2" description="Source data width is WORD (32-bit)"/>
                <bitenum id="LONG" value="0x3" description="Source data width is LONG-WORD (64-bit)"/>
            </bitfield>
            <bitfield id="DMADSTWDTH" description="DMA destination width. This bit selects the destination as a byte, half word, word or long word." begin="13" end="12" width="2" rwaccess="R/W">
                <bitenum id="BYTE" value="0x0" description="Destination data width is BYTE (8-bit)"/>
                <bitenum id="HALF" value="0x1" description="Destination data width is HALF-WORD (16-bit)"/>
                <bitenum id="WORD" value="0x2" description="Destination data width is WORD (32-bit)"/>
                <bitenum id="LONG" value="0x3" description="Destination data width is LONG-WORD (64-bit)"/>
            </bitfield>
            <bitfield id="DMASRCINCR" description="DMA source increment. This bit selects automatic incrementing or decrementing of the source address DMASA for each transfer. The amount of change to the DMASA is based on the definitin in the DMASRCWDTH. For example an increment of 1 (+1) on a WORD transfer will increment the DMASA by 4." begin="19" end="16" width="4" rwaccess="R/W">
                <bitenum id="UNCHANGED" value="0x0" description="Address is unchanged (+0)"/>
                <bitenum id="DECREMENT" value="0x2" description="Decremented by 1 (-1 * DMASRCWDTH)"/>
                <bitenum id="INCREMENT" value="0x3" description="Incremented by 1 (+1 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_2" value="0x8" description="Stride size 2 (+2 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_3" value="0x9" description="Stride size 3 (+3 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_4" value="0xA" description="Stride size 4 (+4 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_5" value="0xB" description="Stride size 5 (+5 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_6" value="0xC" description="Stride size 6 (+6 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_7" value="0xD" description="Stride size 7 (+7 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_8" value="0xE" description="Stride size 8 (+8 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_9" value="0xF" description="Stride size 9 (+9 * DMASRCWDTH)"/>
            </bitfield>
            <bitfield id="DMADSTINCR" description="DMA destination increment. This bit selects automatic incrementing or decrementing of the destination address DMADA for each transfer. The amount of change to the DMADA is based on the definitin in the DMADSTWDTH. For example an increment of 1 (+1) on a WORD transfer will increment the DMADA by 4." begin="23" end="20" width="4" rwaccess="R/W">
                <bitenum id="UNCHANGED" value="0x0" description="Address is unchanged (+0)"/>
                <bitenum id="DECREMENT" value="0x2" description="Decremented by 1 (-1 * DMADSTWDTH)"/>
                <bitenum id="INCREMENT" value="0x3" description="Incremented by 1 (+1 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_2" value="0x8" description="Stride size 2 (+2 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_3" value="0x9" description="Stride size 3 (+3 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_4" value="0xA" description="Stride size 4 (+4 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_5" value="0xB" description="Stride size 5 (+5 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_6" value="0xC" description="Stride size 6 (+6 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_7" value="0xD" description="Stride size 7 (+7 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_8" value="0xE" description="Stride size 8 (+8 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_9" value="0xF" description="Stride size 9 (+9 * DMADSTWDTH)"/>
            </bitfield>
            <bitfield id="DMATM" description="DMA transfer mode register

Note: The repeat-single (2h) and repeat-block (3h) transfer are only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC channel configuration only the values for single (0h) and block (1h) transfer can be set." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="SINGLE" value="0x0" description="Single transfer. Each transfers requires a new trigger. When the DMASZ counts down to zero an event can be generated and the DMAEN is cleared."/>
                <bitenum id="BLOCK" value="0x1" description="Block transfer. Each trigger transfers the complete block defined in DMASZ. After the transfer is complete an event can be generated and the DMAEN is cleared."/>
                <bitenum id="RPTSNGL" value="0x2" description="Repeated single transfer. Each transfers requires a new trigger. When the DMASZ counts down to zero an event can be generated. After the last transfer the DMASA, DMADA, DAMSZ registers are restored to its initial value and the DMAEN stays enabled."/>
                <bitenum id="RPTBLCK" value="0x3" description="Repeated block transfer. Each trigger transfers the complete block defined in DMASZ. After the last transfer the DMASA, DMADA, DAMSZ registers are restored to its initial value and the DMAEN stays enabled."/>
            </bitfield>
            <bitfield id="DMAEM" description="DMA extended mode

Note: The extended transfer modes are only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC channel configuration this register is a read-only register and reads 0x0." begin="25" end="24" width="2" rwaccess="R/W">
                <bitenum id="NORMAL" value="0x0" description="Normal mode is related to transfers from SRC to DST"/>
                <bitenum id="FILLMODE" value="0x2" description="Fill mode will copy the SA register content as data to DA"/>
                <bitenum id="TABLEMODE" value="0x3" description="Table mode will read an address and data value from SA and write the data to address"/>
            </bitfield>
            <bitfield id="DMAPREIRQ" description="Enable an early IRQ event. This can help software to react quicker to and DMA done event or allows some additional configuration before the channel is complete. 

